Greatreyhan/STM32_AMR/STM32_SENSOR_F401/Core/Src/bno055.c
    *buf = (s16)((data[1] << 8) | data[0]) / BNO_MAG_SCALE;
    return BNO_OK;
}

/**
 * Bosch BNO055 read magnetometer data on Y-axis
 * ----------------------------------------------------------------------
 *
 * Reads the magnetometer data and stores the value in the specified
 * buffer. Unit is `[uT]`.

 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_mag_y(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_MAG_DATA_Y_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (s16)((data[1] << 8) | data[0]) / BNO_MAG_SCALE;
    return BNO_OK;
}

/**
 * Bosch BNO055 read magnetometer data on Z-axis
 * ----------------------------------------------------------------------
 *
 * Reads the magnetometer data and stores the value in the specified
 * buffer. Unit is `[uT]`.
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_mag_z(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_MAG_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (s16)((data[1] << 8) | data[0]) / BNO_MAG_SCALE;
    return BNO_OK;
}

/**
 * Bosch BNO055 read magnetometer data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the magnetometer data and stores the value in the specified vector
 * buffer. Unit is `[uT]`.
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_vec3_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_mag(bno055_t* imu, bno055_vec3_t* xyz) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[6];
    if ((err = bno055_read_regs(*imu, BNO_MAG_DATA_X_LSB, data, 6)) != BNO_OK) {
        return err;
    }

    xyz->x = (s16)((data[1] << 8) | data[0]) / BNO_MAG_SCALE;
    xyz->y = (s16)((data[3] << 8) | data[2]) / BNO_MAG_SCALE;
    xyz->z = (s16)((data[5] << 8) | data[4]) / BNO_MAG_SCALE;

    return BNO_OK;
};

/**
 * Bosch BNO055 read gravity data on X-axis
 * ----------------------------------------------------------------------
 *
 * Reads the gravity data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gravity_x(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_GRV_DATA_X_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    f32 scale = (imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                         : BNO_ACC_SCALE_MG;
    *buf = (s16)((data[1] << 8) | data[0]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read gravity data on Y-axis
 * ----------------------------------------------------------------------
 *
 * Reads the gravity data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gravity_y(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_GRV_DATA_Y_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    f32 scale = (imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                         : BNO_ACC_SCALE_MG;
    *buf = (s16)((data[1] << 8) | data[0]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read gravity data on Z-axis
 * ----------------------------------------------------------------------
 *
 * Reads the gravity data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gravity_z(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_GRV_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    f32 scale = (imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                         : BNO_ACC_SCALE_MG;
    *buf = (s16)((data[1] << 8) | data[0]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read gravity data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the gravity data and stores the value in the specified
 * vector buffer. Unit can be selected with `bno055_set_unit(...)` (default:
 * m/s^2).
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_vec3_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gravity(bno055_t* imu, bno055_vec3_t* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[6];
    if ((err = bno055_read_regs(*imu, BNO_GRV_DATA_X_LSB, data, 6)) != BNO_OK) {
        return err;
    }
    f32 scale = (imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                         : BNO_ACC_SCALE_MG;
    buf->x = (s16)((data[1] << 8) | data[0]) / scale;
    buf->y = (s16)((data[3] << 8) | data[2]) / scale;
    buf->x = (s16)((data[5] << 8) | data[4]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read euler yaw data
 * ----------------------------------------------------------------------
 *
 * Reads the yaw data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: deg)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_euler_yaw(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_EUL_HEADING_LSB, data, 2)) !=
        BNO_OK) {
        return err;
    }
    f32 scale = (imu->_eul_unit == BNO_EUL_UNIT_DEG) ? BNO_EUL_SCALE_DEG
                                                     : BNO_EUL_SCALE_RAD;
    *buf = (s16)((data[1] << 8) | data[0]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read euler roll data
 * ----------------------------------------------------------------------
 *
 * Reads the roll data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: deg)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_euler_roll(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_EUL_ROLL_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    f32 scale = (imu->_eul_unit == BNO_EUL_UNIT_DEG) ? BNO_EUL_SCALE_DEG
                                                     : BNO_EUL_SCALE_RAD;
    *buf = (s16)((data[1] << 8) | data[0]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read euler pitch data
 * ----------------------------------------------------------------------
 *
 * Reads the pitch data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: deg)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_euler_pitch(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_EUL_PITCH_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    f32 scale = (imu->_eul_unit == BNO_EUL_UNIT_DEG) ? BNO_EUL_SCALE_DEG
                                                     : BNO_EUL_SCALE_RAD;
    *buf = (s16)((data[1] << 8) | data[0]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read euler data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the euler data and stores the value in the specified
 * vector buffer. Unit can be selected with `bno055_set_unit(...)` (default:
 * deg).
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_euler_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_euler(bno055_t* imu, bno055_euler_t* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[6];
    if ((err = bno055_read_regs(*imu, BNO_EUL_HEADING_LSB, data, 6)) !=
        BNO_OK) {
        return err;
    }
    f32 scale = (imu->_eul_unit == BNO_EUL_UNIT_DEG) ? BNO_EUL_SCALE_DEG
                                                     : BNO_EUL_SCALE_RAD;
    buf->yaw = (s16)((data[1] << 8) | data[0]) / scale;
    buf->roll = (s16)((data[3] << 8) | data[2]) / scale;
    buf->pitch = (s16)((data[5] << 8) | data[4]) / scale;
    return BNO_OK;
}

/**
 * Bosch BNO055 read quaternion W-axis data
 * ----------------------------------------------------------------------
 *
 * Reads the quaternion data and stores the value in the specified
 * buffer.
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_quaternion_w(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_QUA_DATA_W_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    *buf = (s16)((data[1] << 8) | data[0]) / (f32)BNO_QUA_SCALE;
    return BNO_OK;
}

/**
 * Bosch BNO055 read quaternion X-axis data
 * ----------------------------------------------------------------------
 *
 * Reads the quaternion data and stores the value in the specified
 * buffer.
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_quaternion_x(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_QUA_DATA_X_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    *buf = (s16)((data[1] << 8) | data[0]) / (f32)BNO_QUA_SCALE;
    return BNO_OK;
}

/**
 * Bosch BNO055 read quaternion Y-axis data
 * ----------------------------------------------------------------------
 *
 * Reads the quaternion data and stores the value in the specified
 * buffer.
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_quaternion_y(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_QUA_DATA_Y_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    *buf = (s16)((data[1] << 8) | data[0]) / (f32)BNO_QUA_SCALE;
    return BNO_OK;
}

/**
 * Bosch BNO055 read quaternion Z-axis data
 * ----------------------------------------------------------------------
 *
 * Reads the quaternion data and stores the value in the specified
 * buffer.
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_quaternion_z(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_QUA_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }
    *buf = (s16)((data[1] << 8) | data[0]) / (f32)BNO_QUA_SCALE;
    return BNO_OK;
}

/**
 * Bosch BNO055 read quaternion data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the euler data and stores the value in the specified
 * vector buffer. Unit can be selected with `bno055_set_unit(...)` (default:
 * deg).
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_euler_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_quaternion(bno055_t* imu, bno055_vec4_t* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[8];
    if ((err = bno055_read_regs(*imu, BNO_QUA_DATA_W_LSB, data, 8)) != BNO_OK) {
        return err;
    }
    buf->w = (s16)((data[1] << 8) | data[0]) / (f32)BNO_QUA_SCALE;
    buf->x = (s16)((data[3] << 8) | data[2]) / (f32)BNO_QUA_SCALE;
    buf->y = (s16)((data[5] << 8) | data[4]) / (f32)BNO_QUA_SCALE;
    buf->z = (s16)((data[7] << 8) | data[6]) / (f32)BNO_QUA_SCALE;
    return BNO_OK;
}

error_bno bno055_acc_conf(bno055_t* bno, const bno055_acc_range_t range,
                          const bno055_acc_band_t bandwidth,
                          const bno055_acc_mode_t mode) {
    error_bno err;
    if ((err = bno055_set_page(bno, BNO_PAGE_1)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_opmode(bno, BNO_MODE_CONFIG)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_CONFIG_TIME_DELAY + 5);
    u8 config = range | bandwidth | mode;
    if ((err = bno055_write_regs(*bno, BNO_ACC_CONFIG, &config, 1)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_opmode(bno, bno->mode)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_ANY_TIME_DELAY + 5);
    if ((err = bno055_set_page(bno, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
    return BNO_OK;
}

