Greatreyhan/STM32_AMR/STM32_SENSOR_F401/Core/Src/bno055.c
error_bno bno055_gyr_conf(bno055_t* bno, const bno055_gyr_range_t range,
                          const bno055_gyr_band_t bandwidth,
                          const bno055_gyr_mode_t mode) {
    error_bno err;
    if ((err = bno055_set_page(bno, BNO_PAGE_1)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_opmode(bno, BNO_MODE_CONFIG)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_CONFIG_TIME_DELAY + 5);
    u8 config[2] = {range | bandwidth, mode};
    if ((err = bno055_write_regs(*bno, BNO_GYR_CONFIG_0, config, 2)) !=
        BNO_OK) {
        return err;
    }
    if ((err = bno055_set_opmode(bno, bno->mode)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_ANY_TIME_DELAY + 5);
    if ((err = bno055_set_page(bno, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
    return BNO_OK;
}
error_bno bno055_mag_conf(bno055_t* bno, const bno055_mag_rate_t out_rate,
                          const bno055_mag_pwr_t pwr_mode,
                          const bno055_mag_mode_t mode) {
    error_bno err;
    if ((err = bno055_set_page(bno, BNO_PAGE_1)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_opmode(bno, BNO_MODE_CONFIG)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_CONFIG_TIME_DELAY + 5);
    u8 config = out_rate | pwr_mode | mode;
    if ((err = bno055_write_regs(*bno, BNO_MAG_CONFIG, &config, 1)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_opmode(bno, bno->mode)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_ANY_TIME_DELAY + 5);
    if ((err = bno055_set_page(bno, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
    return BNO_OK;
}

error_bno bno055_set_opmode(bno055_t* imu, const bno055_opmode_t opmode) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    if ((err = bno055_write_regs(*imu, BNO_OPR_MODE, (u8*)&opmode, 1)) !=
        BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_ANY_TIME_DELAY + 5);
    return BNO_OK;
}

error_bno bno055_set_unit(bno055_t* bno, const bno055_temp_unitsel_t t_unit,
                          const bno055_gyr_unitsel_t g_unit,
                          const bno055_acc_unitsel_t a_unit,
                          const bno055_eul_unitsel_t e_unit) {
    error_bno err;
    if ((err = bno055_set_opmode(bno, BNO_MODE_CONFIG)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_page(bno, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
    uint8_t data = t_unit | g_unit | a_unit | e_unit;
    if ((err = bno055_write_regs(*bno, BNO_UNIT_SEL, &data, 1)) != BNO_OK) {
        return err;
    }
    bno->_gyr_unit = g_unit;
    bno->_acc_unit = a_unit;
    bno->_eul_unit = e_unit;
    bno->_temp_unit = t_unit;

    if ((err = bno055_set_opmode(bno, bno->mode)) != BNO_OK) {
        return err;
    }
    return BNO_OK;
}

error_bno bno055_set_pwr_mode(bno055_t* imu, bno055_pwr_t pwr_mode) {
    if (imu == NULL) {
        return BNO_ERR_NULL_PTR;
    }
    error_bno err;
    if ((err = bno055_set_opmode(imu, BNO_MODE_CONFIG)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_write_regs(*imu, BNO_PWR_MODE, (u8*)&pwr_mode, 1)) !=
        BNO_OK) {
        return err;
    }
    imu->_pwr_mode = pwr_mode;
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
    if ((err = bno055_set_opmode(imu, imu->mode)) != BNO_OK) {
        return err;
    }
    HAL_Delay(2);
    return BNO_OK;
}

error_bno bno055_reset(bno055_t* imu) {
    u8 data = 0x20U;
    if (bno055_write_regs(*imu, BNO_SYS_TRIGGER, &data, 1) != BNO_OK) {
        return BNO_ERR_I2C;
    }
    return BNO_OK;
}

error_bno bno055_on(bno055_t* imu) {
    u8 data = 0x00U;
    if (bno055_write_regs(*imu, BNO_SYS_TRIGGER, &data, 1) != BNO_OK) {
        return BNO_ERR_I2C;
    }
    return BNO_OK;
}

error_bno bno055_read_regs(bno055_t imu, u8 addr, uint8_t* buf,
                           uint32_t buf_size) {
    HAL_StatusTypeDef err;
    // err = HAL_I2C_Mem_Read(imu.i2c, imu.addr, addr, I2C_MEMADD_SIZE_8BIT,
    // buf,
    //                        buf_size, HAL_MAX_DELAY);
    err = HAL_I2C_Master_Transmit(imu.i2c, imu.addr, &addr, 1, HAL_MAX_DELAY);
    if (err != HAL_OK) {
        return BNO_ERR_I2C;
    }
    err =
        HAL_I2C_Master_Receive(imu.i2c, imu.addr, buf, buf_size, HAL_MAX_DELAY);
    if (err != HAL_OK) {
        return BNO_ERR_I2C;
    }
    return BNO_OK;
}

error_bno bno055_write_regs(bno055_t imu, uint32_t addr, uint8_t* buf,
                            uint32_t buf_size) {
    HAL_StatusTypeDef err;
    err = HAL_I2C_Mem_Write(imu.i2c, imu.addr, addr, buf_size, buf, buf_size,
                            HAL_MAX_DELAY);
    if (err != HAL_OK) {
        return BNO_ERR_I2C;
    }
    return BNO_OK;
}

error_bno bno055_set_page(bno055_t* imu, const bno055_page_t page) {
    if (imu->_page != page) {
        return BNO_OK;
    }
    if (page > 0x01) {
        return BNO_ERR_PAGE_TOO_HIGH;
    }
    error_bno err;
    err = bno055_write_regs(*imu, BNO_PAGE_ID, (u8*)&page, 1);
    if (err != BNO_OK) {
        return err;
    }
    imu->_page = page;
    HAL_Delay(2);
    return BNO_OK;
}

char* bno055_err_str(const error_bno err) {
    switch (err) {
        case BNO_OK:
            return "[BNO] Ok!";
        case BNO_ERR_I2C:
            return "[BNO] I2C error!";
        case BNO_ERR_PAGE_TOO_HIGH:
            return "[BNO] Page setting to high.";
        case BNO_ERR_NULL_PTR:
            return "[BNO] BNO struct is nullpointer.";
        case BNO_ERR_AXIS_REMAP:
            return "[BNO] Axis remap error!";
        case BNO_ERR_SETTING_PAGE:
            return "[BNO] TODO";
        case BNO_ERR_WRONG_CHIP_ID:
            return "[BNO] Wrong Chip ID.";
    }
    return "[BNO] Ok!";
}

void bno055_start(bno055_t* bno, error_bno* err, I2C_HandleTypeDef* hi2c) {
    // Initialize the bno structure
    *bno = (bno055_t){
        .i2c = hi2c,
        .addr = BNO_ADDR_ALT,
        .mode = BNO_MODE_IMU,
        ._temp_unit = 0,
    };

    HAL_Delay(1000);
    if ((*err = bno055_init(bno)) == BNO_OK) {
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, GPIO_PIN_SET);
        HAL_Delay(100);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    } else {
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        Error_Handler();
    }

    HAL_Delay(100);
    *err = bno055_set_unit(bno, BNO_TEMP_UNIT_C, BNO_GYR_UNIT_DPS, BNO_ACC_UNITSEL_M_S2, BNO_EUL_UNIT_DEG);
    if (*err != BNO_OK) {
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, GPIO_PIN_SET);
        HAL_Delay(100);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    } else {
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    }

}

void get_euler_imu(bno055_t* bno, bno055_euler_t* eul, bno055_vec3_t* lia, s8* temperature, BNO055_Typedef* package){
    bno->euler(bno, eul); // Remove the & operators
    bno->linear_acc(bno, lia);
    package->roll = (int16_t)(eul->roll*10);
    package->pitch = (int16_t)(eul->pitch*10);
    package->yaw = (int16_t)(eul->yaw*10);
    package->x_acceleration = (int16_t)(lia->x*10);
    package->y_acceleration = (int16_t)(lia->y*10);
    package->z_acceleration = (int16_t)(lia->z*10);
    package->temperature = (intptr_t)(temperature);
}
